# 絶対必要なもの
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

brew "deno"
brew "ffmpeg"
brew "ghq"
brew "git"
brew "ideviceinstaller"
brew "peco"
brew "pyenv"
brew "starship"
brew "tig"
brew "zsh"
brew "koekeishiya/formulae/yabai"
brew "leoafarias/fvm/fvm"

cask "hyper"
cask "karabiner-elements"
cask "mos"
cask "rectangle"
cask "visual-studio-code"
cask "warp"

# よくわからん、Macに入ってたもの
# brew "jpeg-xl"
# brew "aom"
# brew "glib"
# brew "p11-kit"
# brew "unbound"
# brew "gnutls"
# brew "harfbuzz"
# brew "libarchive"
# brew "libass"
# brew "libbluray"
# brew "srt"
# brew "ghostscript"
# brew "git-lfs"
# brew "python@3.12"
# brew "gobject-introspection"
# brew "guile"
# brew "hub"
# brew "ideviceinstaller"
# brew "jenv"
# brew "neovim"
# brew "nghttp2"
# brew "nim"
# brew "node"
# brew "node-build"
# brew "nodenv"
# brew "pillow"
# brew "python@3.10"
# brew "python@3.9"
# brew "rbenv"
# brew "ripgrep"
# brew "ruby"
# brew "svgo"
# brew "tmux"
# brew "yarn"
# brew "koekeishiya/formulae/skhd"
# brew "qmk/qmk/qmk"
# cask "alacritty"
# cask "alfred"
# cask "clipy"
# cask "fig"
# cask "font-hackgen"
# cask "font-hackgen-nerd"
# cask "font-ricty-diminished"
# cask "iterm2"
# cask "keycastr"
# cask "logseq"

# 以下、VSCode系は必要かわからないのでコメントアウト
# vscode "aaron-bond.better-comments"
# vscode "adrianwilczynski.alpine-js-intellisense"
# vscode "angular.ng-template"
# vscode "bierner.markdown-mermaid"
# vscode "bierner.markdown-preview-github-styles"
# vscode "dart-code.dart-code"
# vscode "dart-code.flutter"
# vscode "dbaeumer.vscode-eslint"
# vscode "denoland.vscode-deno"
# vscode "ecmel.vscode-html-css"
# vscode "editorconfig.editorconfig"
# vscode "esbenp.prettier-vscode"
# vscode "foxundermoon.shell-format"
# vscode "fwcd.kotlin"
# vscode "github.github-vscode-theme"
# vscode "gitlab.gitlab-workflow"
# vscode "janisdd.vscode-edit-csv"
# vscode "jdinhlife.gruvbox"
# vscode "jock.svg"
# vscode "kasik96.swift"
# vscode "liviuschera.noctis"
# vscode "lottiefiles.vscode-lottie"
# vscode "manasxx.background-cover"
# vscode "marp-team.marp-vscode"
# vscode "mgmcdermott.vscode-language-babel"
# vscode "ms-ceintl.vscode-language-pack-ja"
# vscode "ms-vscode.cpptools"
# vscode "ms-vscode.live-server"
# vscode "ms-vsliveshare.vsliveshare"
# vscode "muhammadsammy.flat-ui-dark"
# vscode "nhoizey.gremlins"
# vscode "nimsaem.nimvscode"
# vscode "oderwat.indent-rainbow"
# vscode "pkief.material-icon-theme"
# vscode "sekapi.vscode-working-files"
# vscode "shd101wyy.markdown-preview-enhanced"
# vscode "streetsidesoftware.code-spell-checker"
# vscode "sysoev.language-stylus"
# vscode "teabyii.ayu"
# vscode "vinicioslc.adb-interface-vscode"
# vscode "vscodevim.vim"
# vscode "withfig.fig"
# vscode "yzhang.markdown-all-in-one"
